// Present: Misha Nazarchuk
// Date: 10/03/2025

#include <iostream>
#include <string>
using namespace std;
int main() {
    string a = "";
    cout << "Як звати учасника? ";
    cin >> a;
    cout << "Привіт, " << a << "! Це гра хто хоче стати мільйонером. Відповідайте на питання вибираючи варіант відповіді. У вас є 3 підказки: 50/50, дзвінок другу та допомога залу!\n";
    cout << "Гра складається з 3 раундів. У перших 2 раундах по 4 питання. У 3 Раунді 3 запитання. За кожне правильне питання ви отримуєте грошовий приз. Якщо ви відповіли неправильно, гра завершується.\n";
    cout << "По закінченню кожного раунду ви можете забрати свій приз або продовжити гру.\n";
    cout << "В кожному раунді ви можете скористатися лише 1 підказкою.\n";
    cout << "Гра починається!\n";
    // 1 Питання
    cout << "Раунд 1. Питання на 1000 грн.\n";
    cout << "1. Скільки планет в Сонячній системі?\n";
    cout << "A. 7\n";
    cout << "B. 8\n";
    cout << "C. 9\n";
    cout << "D. 10\n";
    cout << "F. Cкористатися підказками: \n";
    char b = ' ';
    char b1 = ' ';
    char b2 = ' ';
    char b3 = ' ';
    char hint = ' ';
    cout << "Введіть Вашу відповідь: ";
    cin >> b;
    if (b == 'B') {
        cout << "Вітаю, ви відповіли правильно! Ви виграли 1000 грн.\n";
        cout << "Та переходите до наступного питання.\n";}
    else if (b == 'A' || b == 'C' || b == 'D') {
        cout << "Ви відповіли неправильно. Гру завершено.\n";
        exit(0);}
    else if (b == 'F') {
        cout << "Виберіть підказку: \n";
        cout << "1. 50/50\n";
        cout << "2. Дзвінок другу\n";
        cout << "3. Допомога залу\n";
        cin >> hint;
        if (hint == '1') {
            cout << "Ваші варіанти відповідей: B, C\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> b1;
            if (b == 'B') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 1000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (b == 'A' || b == 'C' || b == 'D') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '2') {
            cout << "Ви позвонили вашому другу він вважає що правильна відповідь B\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> b2;
            if (b2 == 'B') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 1000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (b2 == 'A' || b2 == 'C' || b2 == 'D') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '3') {
            cout << "60% залу вважає що правильна відповідь B\n";
            cout << "25% залу вважає що правильна відповідь A\n";
            cout << "10% залу вважає що правильна відповідь C\n";
            cout << "5% залу вважає що правильна відповідь D\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> b3;
            if (b3 == 'B') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 1000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (b3 == 'A' || b3 == 'C' || b3 == 'D') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    // 2 Питання
    char c = ' ';
    char c1 = ' ';
    char c2 = ' ';
    char c3 = ' ';
    char hint1 = ' ';
    cout << "Питання на 2000 грн.\n";
    cout << "2. Як називається найвища гора в світі?\n";
    cout << "A. Еверест\n";
    cout << "B. Кіліманджаро\n";
    cout << "C. Аконкагуа\n";
    cout << "D. Мак-Кінлі\n";
    cout << "F. Cкористатися підказками: \n";
    cout << "Введіть Вашу відповідь: ";
    cin >> c;
    if (c == 'A'){
        cout << "Вітаю, ви відповіли правильно! Ви виграли 2000 грн.\n";
        cout << "Та переходите до наступного питання.\n";}
    else if (c == 'B' || c == 'C' || c == 'D') {
        cout << "Ви відповіли неправильно. Гру завершено.\n";
        exit(0);}
    else if (c == 'F' && b != 'F') {
        cout << "Виберіть підказку: \n";
        cout << "1. 50/50\n";
        cout << "2. Дзвінок другу\n";
        cout << "3. Допомога залу\n";
        cin >> hint1;
        if (hint1 == '1') {
            cout << "Ваші варіанти відповідей: A, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> c1;
            if (c1 == 'A') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 2000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (c1 == 'B' || c1 == 'C' || c1 == 'D') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint1 == '2') {
            cout << "Ви позвонили вашому другу він вважає що правильна відповідь A\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> c2;
            if (c2 == 'A') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 2000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (c2 == 'B' || c2 == 'C' || c2 == 'D') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint1 == '3') {
            cout << "50% залу вважає що правильна відповідь A\n";
            cout << "25% залу вважає що правильна відповідь D\n";
            cout << "15% залу вважає що правильна відповідь C\n";
            cout << "10% залу вважає що правильна відповідь B\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> c3;
            if (c3 == 'A') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 2000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (c3 == 'B' || c3 == 'C' || c3 == 'D') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else if (c == 'F' && b == 'F') {
        cout << "Ви вже скористались підказкою в цьому раунді. Введіть відповідь: ";
        cin >> c;
        if (c == 'A'){
            cout << "Вітаю, ви відповіли правильно! Ви виграли 2000 грн.\n";
            cout << "Та переходите до наступного питання.\n";}
        else if (c == 'B' || c == 'C' || c == 'D') {
            cout << "Ви відповіли неправильно. Гру завершено.\n";
            exit(0);}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    // 3 Питання
    char d = ' ';
    char d1 = ' ';
    char d2 = ' ';
    char d3 = ' ';
    char hint2 = ' ';
    cout << "Питання на 5000 грн.\n";
    cout << "3. Який океан у світі найменший за площею?\n";
    cout << "A. Тихий\n";
    cout << "B. Атлантичний\n";
    cout << "C. Індійський\n";
    cout << "D. Північний Льодовитий\n";
    cout << "F. Cкористатися підказками: \n";
    cout << "Введіть Вашу відповідь: ";
    cin >> d;
    if (d == 'D'){
        cout << "Вітаю, ви відповіли правильно! Ви виграли 5000 грн.\n";
        cout << "Та переходите до наступного питання.\n";}
    else if (d == 'A' || d == 'B' || d == 'C') {
        cout << "Ви відповіли неправильно. Гру завершено.\n";
        exit(0);}
    else if (d == 'F' && b != 'F' && c != 'F') {
        cout << "Виберіть підказку: \n";
        cout << "1. 50/50\n";
        cout << "2. Дзвінок другу\n";
        cout << "3. Допомога залу\n";
        cin >> hint2;
        if (hint2 == '1') {
            cout << "Ваші варіанти відповідей: C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> d1;
            if (d1 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 5000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (d1 == 'A' || d1 == 'B' || d1 == 'C') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint2 == '2') {
            cout << "Ви позвонили вашому другу він вважає що правильна відповідь D\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> d2;
            if (d2 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 5000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (d2 == 'A' || d2 == 'B' || d2 == 'C') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint2 == '3') {
            cout << "40% залу вважає що правильна відповідь D\n";
            cout << "30% залу вважає що правильна відповідь C\n";
            cout << "20% залу вважає що правильна відповідь A\n";
            cout << "10% залу вважає що правильна відповідь B\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> d3;
            if (d3 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 5000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (d3 == 'A' || d3 == 'B' || d3 == 'C') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else if ((d == 'F' && b == 'F') || (d == 'F' && c == 'F')) {
        cout << "Ви вже скористались підказкою в цьому раунді. Введіть відповідь: ";
        cin >> d;
        if (d == 'D'){
            cout << "Вітаю, ви відповіли правильно! Ви виграли 5000 грн.\n";
            cout << "Та переходите до наступного питання.\n";}
        else if (d == 'A' || d == 'B' || d == 'C') {
            cout << "Ви відповіли неправильно. Гру завершено.\n";
            exit(0);}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    // 4 Питання
    char e = ' ';
    char e1 = ' ';
    char e2 = ' ';
    char e3 = ' ';
    char hint3 = ' ';
    cout << "Питання на 10000 грн.\n";
    cout << "4. Яка мова програмування найпопулярніша в світі?\n";
    cout << "A. Python\n";
    cout << "B. Java\n";
    cout << "C. C++\n";
    cout << "D. JavaScript\n";
    cout << "F. Cкористатися підказками: \n";
    cout << "Введіть Вашу відповідь: ";
    cin >> e;
    if (e == 'D'){
        cout << "Вітаю, ви відповіли правильно! Ви виграли 10000 грн.\n";
        cout << "Та переходите до наступного питання.\n";}
    else if (e == 'A' || e == 'B' || e == 'C') {
        cout << "Ви відповіли неправильно. Гру завершено.\n";
        exit(0);}
    else if (e == 'F' && b != 'F' && c != 'F' && d != 'F') {
        cout << "Виберіть підказку: \n";
        cout << "1. 50/50\n";
        cout << "2. Дзвінок другу\n";
        cout << "3. Допомога залу\n";
        cin >> hint3;
        if (hint3 == '1') {
            cout << "Ваші варіанти відповідей: B, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> e1;
            if (e1 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 10000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (e1 == 'A' || e1 == 'B' || e1 == 'C') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint3 == '2') {
            cout << "Ви позвонили вашому другу він вважає що правильна відповідь D\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> e2;
            if (e2 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 10000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (e2 == 'A' || e2 == 'B' || e2 == 'C') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint3 == '3') {
            cout << "60% залу вважає що правильна відповідь D\n";
            cout << "20% залу вважає що правильна відповідь B\n";
            cout << "15% залу вважає що правильна відповідь A\n";
            cout << "5% залу вважає що правильна відповідь C\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> e3;
            if (e3 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 10000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (e3 == 'A' || e3 == 'B' || e3 == 'C') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else if ((e == 'F' && b == 'F') || (e == 'F' && c == 'F') || (e == 'F' && d == 'F')) {
        cout << "Ви вже скористались підказкою в цьому раунді. Введіть відповідь: ";
        cin >> e;
        if (e == 'D'){
            cout << "Вітаю, ви відповіли правильно! Ви виграли 10000 грн.\n";
            cout << "Та переходите до наступного питання.\n";}
        else if (e == 'A' || e == 'B' || e == 'C') {
            cout << "Ви відповіли неправильно. Гру завершено.\n";
            exit(0);}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    int game = 0;
    cout << "Вітаємо " << a << " ви успішно пройшли перший раунд. Ваш виграш складає 10000 грн. Чи бажаєте ви продовжити гру?\n";
    cout << "1. Так\n";
    cout << "2. Ні\n";
    cin >> game;
    if (game == 2){
        cout << "Дякуємо за гру. Ваш виграш складає 10000 грн.\n";
        exit(0);}
    else if (game == 1){
        cout << "Чудово продовжуємо гру!\n";}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    // Раунд 2
    // 1 Питання
    char f = ' ';
    char f1 = ' ';
    char f2 = ' ';
    char f3 = ' ';
    char hint4 = ' ';
    cout << "Питання на 20000 грн.\n";
    cout << "1. Який художник написав картину \'Таємна вечеря\'?\n";
    cout << "A. Леонардо да Вінчі\n";
    cout << "B. Вінсент Ван Гог\n";
    cout << "C. Пабло Пікассо\n";
    cout << "D. Мікеланджело\n";
    cout << "F. Cкористатися підказками: \n";
    cout << "Введіть Вашу відповідь: ";
    cin >> f;
    if (f == 'A'){
        cout << "Вітаю, ви відповіли правильно! Ви виграли 20000 грн.\n";
        cout << "Та переходите до наступного питання.\n";}
    else if (f == 'B' || f == 'C' || f == 'D') {
        cout << "Ви відповіли неправильно. Гру завершено.\n";
        exit(0);}
    else if (f == 'F'){
        // Якщо гравець не використовував підказок
        if (b != 'F' && c != 'F' && d != 'F' && e != 'F') {
            cout << "Виберіть підказку: \n";
            cout << "1. 50/50\n";
            cout << "2. Дзвінок другу\n";
            cout << "3. Допомога залу\n";
            cin >> hint4;
            if (hint4 == '1') {
                cout << "Ваші варіанти відповідей: A, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> f1;
                if (f1 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 20000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (f1 == 'B' || f1 == 'C' || f1 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint4 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь A\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> f2;
                if (f2 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 20000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (f2 == 'B' || f2 == 'C' || f2 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint4 == '3') {
                cout << "70% залу вважає що правильна відповідь A\n";
                cout << "20% залу вважає що правильна відповідь D\n";
                cout << "5% залу вважає що правильна відповідь C\n";
                cout << "5% залу вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> f3;
                if (f3 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 20000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (f3 == 'B' || f3 == 'C' || f3 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказки
        else if (hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1') {
            cout << "Доступні підказки:\n 2. Дзвінок другу\n 3. Допомога залу\n";
            cin >> hint4;
            if (hint4 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь A\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> f2;
                if (f2 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 20000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (f2 == 'B' || f2 == 'C' || f2 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint4 == '3') {
                cout << "50% залу вважає що правильна відповідь A\n";
                cout << "30% залу вважає що правильна відповідь D\n";
                cout << "15% залу вважає що правильна відповідь C\n";
                cout << "5% залу вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> f3;
                if (f3 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 20000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2') {
            cout << "Доступні підказки:\n 1. 50/50\n 3. Допомога залу\n";
            cin >> hint4;
            if (hint4 == '1') {
                cout << "Ваші варіанти відповідей: A, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> f1;
                if (f1 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 20000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (f1 == 'B' || f1 == 'C' || f1 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint4 == '3') {
                cout << "40% залу вважає що правильна відповідь A\n";
                cout << "30% залу вважає що правильна відповідь D\n";
                cout << "20% залу вважає що правильна відповідь C\n";
                cout << "10% залу вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> f3;
                if (f3 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 20000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (f3 == 'B' || f3 == 'C' || f3 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3') {
            cout << "Доступні підказки:\n 1. 50/50\n 2. Дзвінок другу\n";
            cin >> hint4;
            if (hint4 == '1') {
                cout << "Ваші варіанти відповідей: A, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> f1;
                if (f1 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 20000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (f1 == 'B' || f1 == 'C' || f1 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint4 == '2') {
                cout << "50% залу вважає що правильна відповідь A\n";
                cout << "30% залу вважає що правильна відповідь D\n";
                cout << "15% залу вважає що правильна відповідь C\n";
                cout << "5% залу вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> f3;
                if (f3 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 20000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (f3 == 'B' || f3 == 'C' || f3 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    // 2 Питання
    char g = ' ';
    char g1 = ' ';
    char g2 = ' ';
    char g3 = ' ';
    char hint5 = ' ';
    cout << "Питання на 40000 грн.\n";
    cout << "2. Що означає абревіатура HTML?\n";
    cout << "A. Hyper Text Markup Language\n";
    cout << "B. Hyperlinks and Text Markup Language\n";
    cout << "C. Home Tool Markup Language\n";
    cout << "D. Hyper Tool Multi Language\n";
    cout << "F. Cкористатися підказками: \n";
    cout << "Введіть Вашу відповідь: ";
    cin >> g;
    if (g == 'A'){
        cout << "Вітаю, ви відповіли правильно! Ви виграли 40000 грн.\n";
        cout << "Та переходите до наступного питання.\n";}
    else if (g == 'B' || g == 'C' || g == 'D') {
        cout << "Ви відповіли неправильно. Гру завершено.\n";
        exit(0);}
    else if (g == 'F'){
        // Якщо гравець не використовував підказок
        if (b != 'F' && c != 'F' && d != 'F' && e != 'F' && f != 'F') {
            cout << "Виберіть підказку: \n";
            cout << "1. 50/50\n";
            cout << "2. Дзвінок другу\n";
            cout << "3. Допомога залу\n";
            cin >> hint5;
            if (hint5 == '1') {
                cout << "Ваші варіанти відповідей: A, B\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> g1;
                if (g1 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 40000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (g1 == 'B' || g1 == 'C' || g1 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint5 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь A\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> g2;
                if (g2 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 40000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (g2 == 'B' || g2 == 'C' || g2 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint5 == '3') {
                cout << "80% залу вважає що правильна відповідь A\n";
                cout << "10% залу вважає що правильна відповідь B\n";
                cout << "5% залу вважає що правильна відповідь C\n";
                cout << "5% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> g3;
                if (g3 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 40000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (g3 == 'B' || g3 == 'C' || g3 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказки в цьому раунді
        else if (f == 'F'){
            cout << "Ви вже користались підказкою в цьому раунді. Введіть відповідь: ";
            cin >> g;
            if (g == 'A'){
                cout << "Вітаю, ви відповіли правильно! Ви виграли 40000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (g == 'B' || g == 'C' || g == 'D') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказки в попередньому раунді
        else if (hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1') {
            cout << "Доступні підказки:\n 2. Дзвінок другу\n 3. Допомога залу\n";
            cin >> hint5;
            if (hint5 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь A\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> g2;
                if (g2 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 40000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (g2 == 'B' || g2 == 'C' || g2 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint5 == '3') {
                cout << "50% залу вважає що правильна відповідь A\n";
                cout << "30% залу вважає що правильна відповідь D\n";
                cout << "15% залу вважає що правильна відповідь C\n";
                cout << "5% залу вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> g3;
                if (g3 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 40000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2') {
            cout << "Доступні підказки:\n 1. 50/50\n 3. Допомога залу\n";
            cin >> hint5;
            if (hint5 == '1') {
                cout << "Ваші варіанти відповідей: A, B\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> g1;
                if (g1 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 40000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (g1 == 'B' || g1 == 'C' || g1 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint5 == '3') {
                cout << "40% залу вважає що правильна відповідь A\n";
                cout << "30% залу вважає що правильна відповідь D\n";
                cout << "20% залу вважає що правильна відповідь C\n";
                cout << "10% залу вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> g3;
                if (g3 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 40000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (g3 == 'B' || g3 == 'C' || g3 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3') {
            cout << "Доступні підказки:\n 1. 50/50\n 2. Дзвінок другу\n";
            cin >> hint5;
            if (hint5 == '1') {
                cout << "Ваші варіанти відповідей: A, B\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> g1;
                if (g1 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 40000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (g1 == 'B' || g1 == 'C' || g1 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint5 == '2') {
                cout << "50% залу вважає що правильна відповідь A\n";
                cout << "30% залу вважає що правильна відповідь D\n";
                cout << "15% залу вважає що правильна відповідь C\n";
                cout << "5% залу вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> g3;
                if (g3 == 'A') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 40000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (g3 == 'B' || g3 == 'C' || g3 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    // 3 Питання
    char h = ' ';
    char h1 = ' ';
    char h2 = ' ';
    char h3 = ' ';
    char hint6 = ' ';
    cout << "Питання на 80000 грн.\n";
    cout << "3. В якій країні зародилось культура Аніме?\n";
    cout << "A. Корея\n";
    cout << "B. Японія\n";
    cout << "C. Китай\n";
    cout << "D. В'єтнам\n";
    cout << "F. Cкористатися підказками: \n";
    cout << "Введіть Вашу відповідь: ";
    cin >> h;
    if (h == 'B'){
        cout << "Вітаю, ви відповіли правильно! Ви виграли 80000 грн.\n";
        cout << "Та переходите до наступного питання.\n";}
    else if (h == 'A' || h == 'C' || h == 'D') {
        cout << "Ви відповіли неправильно. Гру завершено.\n";
        exit(0);}
    else if (h == 'F'){
        // Якщо гравець не використовував підказок
        if (b != 'F' && c != 'F' && d != 'F' && e != 'F' && f != 'F' && g != 'F') {
            cout << "Виберіть підказку: \n";
            cout << "1. 50/50\n";
            cout << "2. Дзвінок другу\n";
            cout << "3. Допомога залу\n";
            cin >> hint6;
            if (hint6 == '1') {
                cout << "Ваші варіанти відповідей: B, C\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> h1;
                if (h1 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 80000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (h1 == 'C') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint6 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> h2;
                if (h2 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 80000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (h2 == 'A' || h2 == 'C' || h2 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint6 == '3') {
                cout << "70% залу вважає що правильна відповідь B\n";
                cout << "20% залу вважає що правильна відповідь C\n";
                cout << "5% залу вважає що правильна відповідь A\n";
                cout << "5% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> h3;
                if (h3 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 80000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказки в цьому раунді
        else if (f == 'F' || g == 'F'){
            cout << "Ви вже користались підказкою в цьому раунді. Введіть відповідь: ";
            cin >> h;
            if (h == 'B'){
                cout << "Вітаю, ви відповіли правильно! Ви виграли 80000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (h == 'A' || h == 'C' || h == 'D') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказки в попередньому раунді
        else if (hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1') {
            cout << "Доступні підказки:\n 2. Дзвінок другу\n 3. Допомога залу\n";
            cin >> hint6;
            if (hint6 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> h2;
                if (h2 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 80000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (h2 == 'A' || h2 == 'C' || h2 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint6 == '3') {
                cout << "50% залу вважає що правильна відповідь B\n";
                cout << "30% залу вважає що правильна відповідь C\n";
                cout << "15% залу вважає що правильна відповідь A\n";
                cout << "5% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> h3;
                if (h3 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 80000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (h3 == 'A' || h3 == 'C' || h3 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}  
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2') {
            cout << "Доступні підказки:\n 1. 50/50\n 3. Допомога залу\n";
            cin >> hint6;
            if (hint6 == '1') {
                cout << "Ваші варіанти відповідей: B, C\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> h1;
                if (h1 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 80000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (h1 == 'C') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint6 == '3') {
                cout << "40% залу вважає що правильна відповідь B\n";
                cout << "30% залу вважає що правильна відповідь C\n";
                cout << "20% залу вважає що правильна відповідь A\n";
                cout << "10% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> h3;
                if (h3 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 80000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3') {
            cout << "Доступні підказки:\n 1. 50/50\n 2. Дзвінок другу\n";
            cin >> hint6;
            if (hint6 == '1') {
                cout << "Ваші варіанти відповідей: B, C\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> h1;
                if (h1 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 80000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (h1 == 'C') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint6 == '2') {
                cout << "50% залу вважає що правильна відповідь B\n";
                cout << "30% залу вважає що правильна відповідь C\n";
                cout << "15% залу вважає що правильна відповідь A\n";
                cout << "5% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> h3;
                if (h3 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 80000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (h3 == 'A' || h3 == 'C' || h3 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    // 4 Питання
    char i = ' ';
    char i1 = ' ';
    char i2 = ' ';
    char i3 = ' ';
    char hint7 = ' ';
    cout << "Питання на 160000 грн.\n";
    cout << "4. Скільки кісток в скелеті людини?\n";
    cout << "A. 310\n";
    cout << "B. 206\n";
    cout << "C. 256\n";
    cout << "D. 400\n";
    cout << "F. Cкористатися підказками: \n";
    cout << "Введіть Вашу відповідь: ";
    cin >> i;
    if (i == 'B'){
        cout << "Вітаю, ви відповіли правильно! Ви виграли 160000 грн.\n";
        cout << "Та переходите до наступного питання.\n";}
    else if (i == 'A' || i == 'C' || i == 'D') {
        cout << "Ви відповіли неправильно. Гру завершено.\n";
        exit(0);}
    else if (i == 'F'){
        // Якщо гравець не використовував підказок
        if (b != 'F' && c != 'F' && d != 'F' && e != 'F' && f != 'F' && g != 'F' && h != 'F') {
            cout << "Виберіть підказку: \n";
            cout << "1. 50/50\n";
            cout << "2. Дзвінок другу\n";
            cout << "3. Допомога залу\n";
            cin >> hint7;
            if (hint7 == '1') {
                cout << "Ваші варіанти відповідей: B, C\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> i1;
                if (i1 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 160000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (i1 == 'C') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint7 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> i2;
                if (i2 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 160000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (i2 == 'A' || i2 == 'C' || i2 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint7 == '3') {
                cout << "60% залу вважає що правильна відповідь B\n";
                cout << "20% залу вважає що правильна відповідь C\n";
                cout << "10% залу вважає що правильна відповідь A\n";
                cout << "10% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> i3;
                if (i3 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 160000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказки в цьому раунді
        else if (f == 'F' || g == 'F' || h == 'F'){
            cout << "Ви вже користались підказкою в цьому раунді. Введіть відповідь: ";
            cin >> i;
            if (i == 'B'){
                cout << "Вітаю, ви відповіли правильно! Ви виграли 160000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (i == 'A' || i == 'C' || i == 'D') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказки в попередньому раунді
        else if (hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1') {
            cout << "Доступні підказки:\n 2. Дзвінок другу\n 3. Допомога залу\n";
            cin >> hint7;
            if (hint7 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> i2;
                if (i2 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 160000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (i2 == 'A' || i2 == 'C' || i2 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint7 == '3') {
                cout << "50% залу вважає що правильна відповідь B\n";
                cout << "30% залу вважає що правильна відповідь C\n";
                cout << "15% залу вважає що правильна відповідь A\n";
                cout << "5% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> i3;
                if (i3 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 160000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2') {
            cout << "Доступні підказки:\n 1. 50/50\n 3. Допомога залу\n";
            cin >> hint7;
            if (hint7 == '1') {
                cout << "Ваші варіанти відповідей: B, C\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> i1;
                if (i1 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 160000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (i1 == 'C') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint7 == '3') {
                cout << "40% залу вважає що правильна відповідь B\n";
                cout << "30% залу вважає що правильна відповідь C\n";
                cout << "20% залу вважає що правильна відповідь A\n";
                cout << "10% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> i3;
                if (i3 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 160000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3') {
            cout << "Доступні підказки:\n 1. 50/50\n 2. Дзвінок другу\n";
            cin >> hint7;
            if (hint7 == '1') {
                cout << "Ваші варіанти відповідей: B, C\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> i1;
                if (i1 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 160000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (i1 == 'C') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint7 == '2') {
                cout << "50% залу вважає що правильна відповідь B\n";
                cout << "30% залу вважає що правильна відповідь C\n";
                cout << "15% залу вважає що правильна відповідь A\n";
                cout << "5% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> i3;
                if (i3 == 'B'){
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 160000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (i3 == 'A' || i3 == 'C' || i3 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    char game_1 = ' ';
    cout << "Ви завершили 2 раунди. Чи бажаєте ви продовжити гру?\n";
    cout << "A. Так\n";
    cout << "B. Ні\n";
    cout << "Введіть Ваш вибір: ";
    cin >> game_1;
    if (game_1 == 'B') {
        cout << "Дякуємо за гру! Ви виграли 160000 грн.\n";
        exit(0);}
    else if (game_1 == 'A') {
        cout << "Ви переходите до 3 раунду.\n";}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}

    // 3 раунд
    // 1 Питання
    char j = ' ';
    char j1 = ' ';
    char j2 = ' ';
    char j3 = ' ';
    char hint8 = ' ';
    cout << "Питання на 300000 грн.\n";
    cout << "1. Без чого не може обійтися жоден комп'ютер?\n";
    cout << "A. Монітор\n";
    cout << "B. Процесор\n";
    cout << "C. Клавіатура\n";
    cout << "D. Відеокарта\n";
    cout << "F. Cкористатися підказками: \n";
    cout << "Введіть Вашу відповідь: ";
    cin >> j;
    if (j == 'B'){
        cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
        cout << "Та переходите до наступного питання.\n";}
    else if (j == 'A' || j == 'C' || j == 'D') {
        cout << "Ви відповіли неправильно. Гру завершено.\n";
        exit(0);}
    else if (j == 'F'){
        // Якщо гравець не використовував підказок
        if (b != 'F' && c != 'F' && d != 'F' && e != 'F' && f != 'F' && g != 'F' && h != 'F' && i != 'F') {
            cout << "Виберіть підказку: \n";
            cout << "1. 50/50\n";
            cout << "2. Дзвінок другу\n";
            cout << "3. Допомога залу\n";
            cin >> hint8;
            if (hint8 == '1') {
                cout << "Ваші варіанти відповідей: B, C\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> j1;
                if (j1 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (j1 == 'C') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint8 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> j2;
                if (j2 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (j2 == 'A' || j2 == 'C' || j2 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint8 == '3') {
                cout << "80% залу вважає що правильна відповідь B\n";
                cout << "10% залу вважає що правильна відповідь C\n";
                cout << "5% залу вважає що правильна відповідь A\n";
                cout << "5% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> j3;
                if (j3 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказки в попередіх раундах
        else if ((hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1' || hint4 == '1' || hint5 == '1' || hint6 == '1' || hint7 == '1') && (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2' || hint4 == '2' || hint5 == '2' || hint6 == '2' || hint7 == '2')){
            cout << "У Вас залишилась тільки одна підказка: Допомога залу\n";
            cout << "45% залу вважає що правильна відповідь B\n";
            cout << "30% залу вважає що правильна відповідь C\n";
            cout << "15% залу вважає що правильна відповідь A\n";
            cout << "10% залу вважає що правильна відповідь D\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> j3;
            if (j3 == 'B') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (j3 == 'A' || j3 == 'C' || j3 == 'D') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if ((hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3' || hint4 == '3' || hint5 == '3' || hint6 == '3' || hint7 == '3') && (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2' || hint4 == '2' || hint5 == '2' || hint6 == '2' || hint7 == '2')){
            cout << "У Вас залишилась тільки одна підказка: 50/50\n";
            cout << "Ваші варіанти відповідей: B, C\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> j1;
            if (j1 == 'B') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (j1 == 'C') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if ((hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1' || hint4 == '1' || hint5 == '1' || hint6 == '1' || hint7 == '1') && (hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3' || hint4 == '3' || hint5 == '3' || hint6 == '3' || hint7 == '3')){
            cout << "У Вас залишилась тільки одна підказка: Дзвінок другу\n";
            cout << "Ви позвонили вашому другу він вважає що правильна відповідь B\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> j2;
            if (j2 == 'B') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (j2 == 'A' || j2 == 'C' || j2 == 'D') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2' || hint4 == '2' || hint5 == '2' || hint6 == '2' || hint7 == '2'){
            cout << "У Вас залишились 2 підказки: 1: 50/50, 3: Допомога залу\n";
            cout << "Виберіть підказку: \n";
            cin >> hint8;
            if (hint8 == '1') {
                cout << "Ваші варіанти відповідей: B, C\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> j1;
                if (j1 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (j1 == 'C') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint8 == '3') {
                cout << "70% залу вважає що правильна відповідь B\n";
                cout << "20% залу вважає що правильна відповідь C\n";
                cout << "5% залу вважає що правильна відповідь A\n";
                cout << "5% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> j3;
                if (j3 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3' || hint4 == '3' || hint5 == '3' || hint6 == '3' || hint7 == '3'){
            cout << "У Вас залишились 2 підказки: 1: 50/50, 2: Дзвінок другу\n";
            cout << "Виберіть підказку: \n";
            cin >> hint8;
            if (hint8 == '1') {
                cout << "Ваші варіанти відповідей: B, C\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> j1;
                if (j1 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (j1 == 'C') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint8 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> j2;
                if (j2 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (j2 == 'A' || j2 == 'C' || j2 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1' || hint4 == '1' || hint5 == '1' || hint6 == '1' || hint7 == '1'){
            cout << "У Вас залишились 2 підказки: 2: Дзвінок другу, 3: Допомога залу\n";
            cout << "Виберіть підказку: \n";
            cin >> hint8;
            if (hint8 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь B\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> j2;
                if (j2 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (j2 == 'A' || j2 == 'C' || j2 == 'D') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint8 == '3') {
                cout << "90% залу вважає що правильна відповідь B\n";
                cout << "5% залу вважає що правильна відповідь C\n";
                cout << "3% залу вважає що правильна відповідь A\n";
                cout << "2% залу вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> j3;
                if (j3 == 'B') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 300000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    // 2 Питання
    char k = ' ';
    char k1 = ' ';
    char k2 = ' ';
    char k3 = ' ';
    char hint9 = ' ';
    cout << "Питання на 500000 грн.\n";
    cout << "2. Який хімічний елемент є найпоширенішим у Всесвіті?\n";
    cout << "A. Вуглець\n";
    cout << "B. Оксиген\n";
    cout << "C. Кисень\n";
    cout << "D. Водень\n";
    cout << "F. Cкористатися підказками: \n";
    cout << "Введіть Вашу відповідь: ";
    cin >> k;
    if (k == 'D'){
        cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
        cout << "Та переходите до наступного питання.\n";}
    else if (k == 'A' || k == 'C' || k == 'B') {
        cout << "Ви відповіли неправильно. Гру завершено.\n";
        exit(0);}
    else if (k == 'F'){
        // Якщо гравець не використовував підказок
        if ((b != 'F' && c != 'F' && d != 'F' && e != 'F' && f != 'F' && g != 'F' && h != 'F' && i != 'F' && j != 'F')) {
            cout << "Виберіть підказку: \n";
            cout << "1. 50/50\n";
            cout << "2. Дзвінок другу\n";
            cout << "3. Допомога залу\n";
            cin >> hint9;
            if (hint9 == '1') {
                cout << "Ваші варіанти відповідей: B, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> k1;
                if (k1 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (k1 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint9 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> k2;
                if (k2 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (k2 == 'A' || k2 == 'C' || k2 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint9 == '3') {
                cout << "60% залу вважає що правильна відповідь D\n";
                cout << "20% залу вважає що правильна відповідь B\n";
                cout << "10% залу вважає що правильна відповідь A\n";
                cout << "10% залу вважає що правильна відповідь C\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> k3;
                if (k3 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказку в цьому раунді
        else if (j == 'F'){
            cout << "Ви використовували підказку в цьому раунді.\n";
            cout << "Виберіть відповідь: \n";
            cin >> k3;
            if (k3 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (k3 == 'A' || k3 == 'C' || k3 == 'B') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказки в попередіх раундах
        else if ((hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1' || hint4 == '1' || hint5 == '1' || hint6 == '1' || hint7 == '1') && (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2' || hint4 == '2' || hint5 == '2' || hint6 == '2' || hint7 == '2')){
            cout << "У Вас залишилась тільки одна підказка: Допомога залу\n";
            cout << "40% залу вважає що правильна відповідь D\n";
            cout << "30% залу вважає що правильна відповідь B\n";
            cout << "20% залу вважає що правильна відповідь A\n";
            cout << "10% залу вважає що правильна відповідь C\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> k3;
            if (k3 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (k3 == 'A' || k3 == 'C' || k3 == 'B') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if ((hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3' || hint4 == '3' || hint5 == '3' || hint6 == '3' || hint7 == '3') && (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2' || hint4 == '2' || hint5 == '2' || hint6 == '2' || hint7 == '2')){
            cout << "У Вас залишилась тільки одна підказка: 50/50\n";
            cout << "Ваші варіанти відповідей: B, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> k1;
            if (k1 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (k1 == 'B') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if ((hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1' || hint4 == '1' || hint5 == '1' || hint6 == '1' || hint7 == '1') && (hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3' || hint4 == '3' || hint5 == '3' || hint6 == '3' || hint7 == '3')){
            cout << "У Вас залишилась тільки одна підказка: Дзвінок другу\n";
            cout << "Ви позвонили вашому другу він вважає що правильна відповідь D\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> k2;
            if (k2 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                cout << "Та переходите до наступного питання.\n";}
            else if (k2 == 'A' || k2 == 'C' || k2 == 'B') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2' || hint4 == '2' || hint5 == '2' || hint6 == '2' || hint7 == '2'){
            cout << "У Вас залишились 2 підказки: 1: 50/50, 3: Допомога залу\n";
            cout << "Виберіть підказку: \n";
            cin >> hint9;
            if (hint9 == '1') {
                cout << "Ваші варіанти відповідей: B, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> k1;
                if (k1 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (k1 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint9 == '3') {
                cout << "50% залу вважає що правильна відповідь D\n";
                cout << "30% залу вважає що правильна відповідь B\n";
                cout << "10% залу вважає що правильна відповідь A\n";
                cout << "10% залу вважає що правильна відповідь C\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> k3;
                if (k3 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3' || hint4 == '3' || hint5 == '3' || hint6 == '3' || hint7 == '3'){
            cout << "У Вас залишились 2 підказки: 1: 50/50, 2: Дзвінок другу\n";
            cout << "Виберіть підказку: \n";
            cin >> hint9;
            if (hint9 == '1') {
                cout << "Ваші варіанти відповідей: B, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> k1;
                if (k1 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (k1 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint9 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> k2;
                if (k2 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (k2 == 'A' || k2 == 'C' || k2 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1' || hint4 == '1' || hint5 == '1' || hint6 == '1' || hint7 == '1'){
            cout << "У Вас залишились 2 підказки: 2: Дзвінок другу, 3: Допомога залу\n";
            cout << "Виберіть підказку: \n";
            cin >> hint9;
            if (hint9 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> k2;
                if (k2 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}
                else if (k2 == 'A' || k2 == 'C' || k2 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint9 == '3') {
                cout << "80% залу вважає що правильна відповідь D\n";
                cout << "10% залу вважає що правильна відповідь B\n";
                cout << "5% залу вважає що правильна відповідь A\n";
                cout << "5% залу вважає що правильна відповідь C\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> k3;
                if (k3 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 500000 грн.\n";
                    cout << "Та переходите до наступного питання.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    // Фінальне питання
    cout << "Вітаємо " << a << " Ви виграли 500000 грн.\n";
    cout << "Фінальне питання на 1000000 грн.\n";
    cout << "У вас є остання можливість забрати виграш і вийти з гри.\n";
    cout << "Чи бажаєте ви взяти виграш і вийти з гри?\n";
    cout << "Або ж ви ризикнете і відповісте на фінальне питання?\n";
    cout << "A. Взяти виграш і вийти з гри\n";
    cout << "B. Відповісти на фінальне питання\n";
    char game_final = ' ';
    cin >> game_final;
    if (game_final == 'A'){
        cout << "Ви взяли виграш і вийшли з гри. Ваш виграш 500000 грн.\n";
        exit(0);}
    else if (game_final == 'B'){
        cout <<"3. Яке місто є найдовше заселеним містом світу безперервно?\n";
        cout << "A. Мехіко (Мексика)\n";
        cout << "B. Лондон (Великобританія)\n";
        cout << "C. Істанбул (Туреччина)\n";
        cout << "D. Єрихон (Палестина)\n";
        cout << "F. Cкористатися підказками: \n";
    }
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    char l = ' ';
    char l1 = ' ';
    char l2 = ' ';
    char l3 = ' ';
    char hint10 = ' ';
    cin >> l;
    if (l == 'D'){
        cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
        cout << "Та стали мільйонером.\n";}
    else if (l == 'A' || l == 'C' || l == 'B') {
        cout << "Ви відповіли неправильно. Гру завершено.\n";
        exit(0);}
    else if (l == 'F'){
        // Якщо гравець не використовував підказок
        if ((b != 'F' && c != 'F' && d != 'F' && e != 'F' && f != 'F' && g != 'F' && h != 'F' && i != 'F' && j != 'F' && k != 'F')) {
            cout << "Виберіть підказку: \n";
            cout << "1. 50/50\n";
            cout << "2. Дзвінок другу\n";
            cout << "3. Допомога залу\n";
            cin >> hint10;
            if (hint10 == '1') {
                cout << "Ваші варіанти відповідей: B, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> l1;
                if (l1 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                    cout << "Та стали мільйонером.\n";}
                else if (l1 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint10 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> l2;
                if (l2 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                    cout << "Та стали мільйонером.\n";}
                else if (l2 == 'A' || l2 == 'C' || l2 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint10 == '3') {
                cout << "70% залу вважає що правильна відповідь D\n";
                cout << "20% залу вважає що правильна відповідь B\n";
                cout << "5% залу вважає що правильна відповідь A\n";
                cout << "5% залу вважає що правильна відповідь C\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> l3;
                if (l3 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграл 1000000 грн.\n";
                    cout << "Та стали мільйонером.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказку в цьому раунді
        else if (j == 'F' || k == 'F'){
            cout << "Ви використовували підказку в цьому раунді.\n";
            cout << "Виберіть відповідь: \n";
            cin >> l3;
            if (l3 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                cout << "Та стали мільйонером.\n";}
            else if (l3 == 'A' || l3 == 'C' || l3 == 'B') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        // Якщо гравець використовував підказки в попередіх раундах
        else if ((hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1' || hint4 == '1' || hint5 == '1' || hint6 == '1' || hint7 == '1') && (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2' || hint4 == '2' || hint5 == '2' || hint6 == '2' || hint7 == '2')){
            cout << "У Вас залишилась тільки одна підказка: Допомога залу\n";
            cout << "50% залу вважає що правильна відповідь D\n";
            cout << "30% залу вважає що правильна відповідь B\n";
            cout << "10% залу вважає що правильна відповідь A\n";
            cout << "10% залу вважає що правильна відповідь C\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> l3;
            if (l3 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                cout << "Та стали мільйонером.\n";}
            else if (l3 == 'A' || l3 == 'C' || l3 == 'B') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if ((hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3' || hint4 == '3' || hint5 == '3' || hint6 == '3' || hint7 == '3') && (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2' || hint4 == '2' || hint5 == '2' || hint6 == '2' || hint7 == '2')){
            cout << "У Вас залишилась тільки одна підказка: 50/50\n";
            cout << "Ваші варіанти відповідей: B, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> l1;
            if (l1 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                cout << "Та стали мільйонером.\n";}
            else if (l1 == 'B') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if ((hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1' || hint4 == '1' || hint5 == '1' || hint6 == '1' || hint7 == '1') && (hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3' || hint4 == '3' || hint5 == '3' || hint6 == '3' || hint7 == '3')){
            cout << "У Вас залишилась тільки одна підказка: Дзвінок другу\n";
            cout << "Ви позвонили вашому другу він вважає що правильна відповідь D\n";
            cout << "Доступні варіанти відповідей: A, B, C, D\n";
            cout << "Введіть Вашу відповідь: ";
            cin >> l2;
            if (l2 == 'D') {
                cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                cout << "Та стали мільйонером.\n";}
            else if (l2 == 'A' || l2 == 'C' || l2 == 'B') {
                cout << "Ви відповіли неправильно. Гру завершено.\n";
                exit(0);}
            else {
                cout << " Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '2' || hint1 == '2' || hint2 == '2' || hint3 == '2' || hint4 == '2' || hint5 == '2' || hint6 == '2' || hint7 == '2'){
            cout << "У Вас залишились 2 підказки: 1: 50/50, 3: Допомога залу\n";
            cout << "Виберіть підказку: \n";
            cin >> hint10;
            if (hint10 == '1') {
                cout << "Ваші варіанти відповідей: B, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> l1;
                if (l1 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                    cout << "Та стали мільйонером.\n";}
                else if (l1 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint10 == '3') {
                cout << "50% залу вважає що правильна відповідь D\n";
                cout << "30% залу вважає що правильна відповідь B\n";
                cout << "10% залу вважає що правильна відповідь A\n";
                cout << "10% залу вважає що правильна відповідь C\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> l3;
                if (l3 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                    cout << "Та стали мільйонером.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '3' || hint1 == '3' || hint2 == '3' || hint3 == '3' || hint4 == '3' || hint5 == '3' || hint6 == '3' || hint7 == '3'){
            cout << "У Вас залишились 2 підказки: 1: 50/50, 2: Дзвінок другу\n";
            cout << "Виберіть підказку: \n";
            cin >> hint10;
            if (hint10 == '1') {
                cout << "Ваші варіанти відповідей: B, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> l1;
                if (l1 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                    cout << "Та стали мільйонером.\n";}
                else if (l1 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint10 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> l2;
                if (l2 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                    cout << "Та стали мільйонером.\n";}
                else if (l2 == 'A' || l2 == 'C' || l2 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else if (hint == '1' || hint1 == '1' || hint2 == '1' || hint3 == '1' || hint4 == '1' || hint5 == '1' || hint6 == '1' || hint7 == '1'){
            cout << "У Вас залишились 2 підказки: 2: Дзвінок другу, 3: Допомога залу\n";
            cout << "Виберіть підказку: \n";
            cin >> hint10;
            if (hint10 == '2') {
                cout << "Ви позвонили вашому другу він вважає що правильна відповідь D\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> l2;
                if (l2 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                    cout << "Та стали мільйонером.\n";}
                else if (l2 == 'A' || l2 == 'C' || l2 == 'B') {
                    cout << "Ви відповіли неправильно. Гру завершено.\n";
                    exit(0);}
                else {
                    cout << " Ви ввели неправильні дані. Гру завершено.\n";
                    exit(0);}}
            else if (hint10 == '3') {
                cout << "80% залу вважає що правильна відповідь D\n";
                cout << "10% залу вважає що правильна відповідь B\n";
                cout << "5% залу вважає що правильна відповідь A\n";
                cout << "5% залу вважає що правильна відповідь C\n";
                cout << "Доступні варіанти відповідей: A, B, C, D\n";
                cout << "Введіть Вашу відповідь: ";
                cin >> l3;
                if (l3 == 'D') {
                    cout << "Вітаю, ви відповіли правильно! Ви виграли 1000000 грн.\n";
                    cout << "Та стали мільйонером.\n";}}
            else {
                cout << "Ви ввели неправильні дані. Гру завершено.\n";
                exit(0);}}
        else {
            cout << "Ви ввели неправильні дані. Гру завершено.\n";
            exit(0);}}
    else {
        cout << "Ви ввели неправильні дані. Гру завершено.\n";
        exit(0);}
    return 0;
}